#印字指令 print()｜print() 的排版指令
#排版指令
'''
python2.5前的指令
print ("%10d" %(18))


python2.6後的指令
print ("{0:10d}".format(18))
print("表示資料的編號 : 輸出的格式 輸多的進制".format(表示資料))
'''
#2.5
print("%10d" %(18))
#2.6
print("{0:10d}".format(18))


#Ex
print("{} / {} = {}".format(10 , 3 ,10/3))
print("{0} / {1} = {2}".format(10 , 3 , 10/3))
print("{2} / {1} = {0}".format(10/3 , 3 , 10))
print("{x} / {y} = {result}".format(result = 10/3 , y = 3 , x = 10))

'''
ｂ：整數　２進制
ｏ：整數　８進制
ｄ：整數　１０進制
ｘ：整數　１６進制
ｆ：浮點數　一般
ｅ：浮點數　科學記數
ｇ：浮點數　一般／科學記數
ｓ：字串
％：百分比
'''
#{result:10.2f} 保留10個位置,而小數佔2個位
print("{x:10d} / {y:10d} = {result:10.2f}".format(result = 10/3 , y = 3 , x = 10))

#對齊
#在表示資料的編號後加上 '<' / '^' / '>' {x:<10d}
print("{x:<10d} / {y:^10d} = {result:>10.2f}".format(result = 10/3 , y = 3 , x = 10))

#逗點&補字
#逗點
print("你的剩餘為HK${0:,.2f}".format(123456789.99))

#補字
#補字要在對齊字元前才能有效
print("你的剩餘為HK${0:*>20,.2f}".format(123456789,99))
